{
  "patient_id": "T006_UNITS",
  "refined_query": "Medications: Insulin | Conditions: Diabetes, Kidney Disease | Allergies:  | Labs: Creatinine: 150 µmol/L, eGFR: 45 mL/min/1.73m², HbA1c: 8.5 mmol/mol | Demographics: Weight: 70kg, Age: 60",
  "section_selection_summary": {
    "total_drugs": 1,
    "total_sections_queried": 6,
    "sections_per_drug": {
      "Insulin": 6
    },
    "standard_sections_would_be": 7,
    "efficiency_gain_percent": 14.3,
    "selection_rationale": {
      "base_sections": "names, pharmacology (always included)",
      "conditions_based": "indications added due to patient conditions",
      "allergy_based": "contraindications added due to allergies",
      "lab_based": "toxicity added due to lab abnormalities",
      "metabolism_based": "metabolism/dosage added due to age/weight/renal function",
      "interaction_based": "interactions added due to multiple medications"
    }
  },
  "drug_data": [
    {
      "drug_name": "Insulin",
      "selected_sections": [
        "pharmacology",
        "metabolism",
        "dosage",
        "toxicity",
        "indications",
        "names"
      ],
      "sections": {
        "pharmacology": [
          {
            "drug_id": "DB00071",
            "section": "pharmacology",
            "text": "Mechanism of Action: Insulin binds to the insulin receptor (IR), a heterotetrameric protein consisting of two extracellular alpha units and two transmembrane beta units. The binding of insulin to the alpha subunit of IR stimulates the tyrosine kinase activity intrinsic to the beta subunit of the receptor. The bound receptor is able to autophosphorylate and phosphorylate numerous intracellular substrates such as insulin receptor substrates (IRS) proteins, Cbl, APS, Shc and Gab 1. These activated proteins, in turn, lead to the activation of downstream signaling molecules including PI3 kinase and Akt. Akt regulates the activity of glucose transporter 4 (GLUT4) and protein kinase C (PKC) which play a critical role in metabolism. | Pharmacodynamics: Insulin is used in the treatment of type I and type II diabetes. The primary activity of insulin is the regulation of glucose metabolism. In muscle and other tissues (except the brain), insulin causes rapid transport of glucose and amino acids intracellularly. It also promotes anabolism, and inhibits protein catabolism. In the liver, insulin promotes the uptake and storage of glucose in the form of glycogen, inhibits gluconeogenesis, and promotes the conversion of excess glucose into fat.",
            "similarity_score": 92.07
          },
          {
            "drug_id": "DB00030",
            "section": "pharmacology",
            "text": "Mechanism of Action: The primary activity of insulin is the regulation of glucose metabolism. Insulin promotes glucose and amino acid uptake into muscle and adipose tissues, and other tissues except brain and liver. It also has an anabolic role in stimulating glycogen, fatty acid, and protein synthesis. Insulin inhibits gluconeogenesis in the liver.\r\nInsulin binds to the insulin receptor (IR), a heterotetrameric protein consisting of two extracellular alpha units and two transmembrane beta units. The binding of insulin to the alpha subunit of IR stimulates the tyrosine kinase activity intrinsic to the beta subunit of the receptor. The bound receptor is able to autophosphorylate and phosphorylate numerous intracellular substrates such as insulin receptor substrates (IRS) proteins, Cbl, APS, Shc and Gab 1. These activated proteins, in turn, lead to the activation of downstream signaling molecules including PI3 kinase and Akt. Akt regulates the activity of glucose transporter 4 (GLUT4) and protein kinase C (PKC) which play a critical role in metabolism and catabolism. | Pharmacodynamics: Insulin is a natural hormone produced by beta cells of the pancreas. In non-diabetic individuals, a basal level of insulin is supplemented with insulin spikes following meals. Postprandial insulin spikes are responsible for the metabolic changes that occur as the body transitions from a postabsorptive to absorptive state. Insulin promotes cellular uptake of glucose, particularly in muscle and adipose tissues, promotes energy storage via glycogenesis, opposes catabolism of energy stores, increases DNA replication and protein synthesis by stimulating amino acid uptake by liver, muscle and adipose tissue, and modifies the activity of numerous enzymes involved in glycogen synthesis and glycolysis. Insulin also promotes growth and is required for the actions of growth hormone (e.g. protein synthesis, cell division, DNA synthesis).",
            "similarity_score": 91.78
          },
          {
            "drug_id": "DB00046",
            "section": "pharmacology",
            "text": "Mechanism of Action: Insulin lispro binds to the insulin receptor (IR), a heterotetrameric protein consisting of two extracellular alpha units and two transmembrane beta units. The binding of insulin to the alpha subunit of IR stimulates the tyrosine kinase activity intrinsic to the beta subunit of the receptor. The bound receptor autophosphorylates and phosphorylates numerous intracellular substrates such as insulin receptor substrates (IRS) proteins, Cbl, APS, Shc and Gab 1. Activation of these proteins leads to the activation of downstream signaling molecules including PI3 kinase and Akt. Akt regulates the activity of glucose transporter 4 (GLUT4) and protein kinase C (PKC), both of which play critical roles in metabolism and catabolism. In humans, insulin is stored in the form of hexamers; however, only insulin monomers are able to interact with IR. Reversal of the proline and lysine residues at positions B28 and B29 of native insulin eliminates hydrophobic interactions and weakens some of the hydrogen bonds that contribute to the stability of the insulin dimers that comprise insulin hexamers. Hexamers of insulin lispro are produced in the presence of zinc and <i>m</i>-cresol. These weakly associated hexamers quickly dissociate upon subcutaneous injection and are absorbed as monomers through vascular endothelial cells. These properties give insulin lispro its fast-acting properties. | Pharmacodynamics: Insulin is a natural hormone produced by beta cells of the pancreas. In non-diabetic individuals, a basal level of insulin is supplemented with insulin spikes following meals. Increased insulin secretion following meals is responsible for the metabolic changes that occur as the body transitions from a postabsorptive to absorptive state. Insulin promotes cellular uptake of glucose, particularly in muscle and adipose tissues, promotes energy storage via glycogenesis, opposes catabolism of energy stores, increases DNA replication and protein synthesis by stimulating amino acid uptake by liver, muscle and adipose tissue, and modifies the activity of numerous enzymes involved in glycogen synthesis and glycolysis. Insulin also promotes growth and is required for the actions of growth hormone (e.g. protein synthesis, cell division, DNA synthesis). Insulin lispro is a rapid-acting insulin analogue used to mimic postprandial insulin spikes in diabetic individuals. The onset of action of insulin lispro is 10-15 minutes. Its activity peaks 60 minutes following subcutaneous injection and its duration of action is 4-5 hours. Compared to regular human insulin, insulin lispro  has a more rapid onset of action and a shorter duration of action. Insulin lispro is also shown to be equipotent to human insulin on a molar basis.  \r\n\r\nInsulin lispro has been shown to be equipotent to human insulin on a molar basis. One unit of insulin lispro has the same glucose-lowering effect as one unit of regular human insulin. Studies in normal volunteers and patients with diabetes demonstrated that insulin lispro has a more rapid onset of action and a shorter duration of activity than regular human insulin when given subcutaneously.[L47616]\r\n\r\nThe pharmacodynamics of a single 20 unit dose of insulin lispro at 200 units/mL (HUMALOG U-200) administered subcutaneously were compared to the pharmacodynamics of a single 20 unit dose of insulin lispro at 100 units/mL (HUMALOG U-100) administered subcutaneously in a euglycemic clamp study enrolling healthy subjects. In this study, the overall, maximum, and time to maximum glucose lowering effect were similar between HUMALOG U-200 and HUMALOG U-100. The mean area under the glucose infusion rate curves (measure of overall pharmacodynamic effect) were 125 g and 126 g for HUMALOG U-200 and HUMALOG U-100, respectively. The maximum glucose infusion rate was 534 mg/min and 559 mg/min and the corresponding median time (min, max) to maximum effect were 2.8 h (0.5 h – 6.3 h) and 2.4 h (0.5 h – 4.7 h) for HUMALOG U-200 and HUMALOG U-100, respectively.[L47616]",
            "similarity_score": 91.51
          }
        ],
        "metabolism": [
          {
            "drug_id": "DB00071",
            "section": "metabolism",
            "text": "Metabolism: Insulin is predominantly cleared by metabolic degradation via a receptor-mediated process.",
            "similarity_score": 93.93
          },
          {
            "drug_id": "Unknown Drug",
            "section": "metabolism",
            "text": "Absorption: It has been reported that administration of 10-15% of intravenous invert sugar solution is rapidly absorbed in the intestine and distributed in blood without exceeding the renal threshold.[A32124] The absorption of invert sugar happens mainly as monosaccharides. Glucose is absorbed into the portal vein by the transporter GLUT2 while fructose is absorbed by the transporter GLUT5.[A32126] | Metabolism: The metabolism of invert sugar and other fructose-glucose sweeteners is not meaningfully different. Once absorbed, the fructose monosaccharides are taken up by the liver and bypass a key step regulatory step in glycolysis.[A32126] Both of the monosaccharides first step metabolism is marked by its phosphorylation to glucose-6-phosphate by glucokinase or fructose-1-phosphate by fructokinase. After this step, the glycolysis continues its pathway until the obtention of pyruvic acid.[T129] The metabolism of fructose is more rapid than the one of glucose and thus, it is possible to administer at the same speed than a glucose dose correspondent to 55% of the invert sugar dose.[T130] | Half-life: The glucose half-life following intravenous administration of invert sugar is of approximately 30 min. In the same report, the half-life of fructose after the intravenous administration is reported to be 16 min.[A19407]",
            "similarity_score": 90.6
          },
          {
            "drug_id": "Unknown Drug",
            "section": "metabolism",
            "text": "Absorption: In patients with type 1 diabetes, after 8 days of once-daily subcutaneous dosing with 0.4 U/kg, maximum insulin degludec concentrations of 4472 pmol/L were attained at a median of 9 hours (t<sub>max</sub>).[L42400] After the first dose, the median onset of appearance was around one hour. The glucose-lowering effect lasted at least 42 hours after the last of 8 once-daily injections. Insulin degludec concentration reaches steady-state levels after 3-4 days.[L42400] | Metabolism: All insulin degludec metabolites are inactive.[L42400] The liver and kidney play the major role in metabolizing insulin.[A231654]However, while the liver predominantly metabolizes endogenous insulin, exogenous insulin is primarily metabolized due to the kidney since it is not directly delivered into the portal system.[A231654] | Half-life: The half-life after subcutaneous administration is determined primarily by the rate of absorption from the subcutaneous tissue. On average, the half-life at a steady state is approximately 25 hours independent of dose.[L42400] | Clearance: The mean apparent clearance of insulin degludec is 0.03 L/kg (2.1 L/h in 70 kg individuals) after a single subcutaneous dose of 0.4 units/kg.[L42400] | Protein Binding: The affinity of insulin degludec to serum albumin corresponds to a plasma protein binding of >99% in human plasma.[L42400] The results of the in vitro protein binding studies demonstrate that there is no clinically relevant interaction between insulin degludec and other protein-bound drugs.[L42400]",
            "similarity_score": 90.43
          }
        ],
        "dosage": [],
        "toxicity": [
          {
            "drug_id": "Unknown Drug",
            "section": "toxicity",
            "text": "Toxicity: Invert sugar is a generally accepted safe substance and it does not present toxic effects. Do not administer invert sugar in patients with the rare hereditary problems of fructose intolerance, glucose-galactose malabsorption or sucrose-isomaltase insufficiency. It is also recommended to take precautions in patients that present diabetes mellitus.[L1691]",
            "similarity_score": 92.84
          },
          {
            "drug_id": "DB00034",
            "section": "toxicity",
            "text": "Toxicity: Interferon alfa-2 may cause serious adverse effects such as anemia; autoimmune diseases, including vasculitis, arthritis, hemolytic anemia, and erythematosus syndrome; cardiotoxicity; hepatotoxicity; hyperthyroidism or hypothyroidism; transient ischemic attacks; leukopenia; neurotoxicity; peripheral neuropathy; and thrombocytopenia. Some lesser side effects that may not need medical attention include blurred vision, change in taste or metallic taste, cold sores or stomatitis, diarrhea, dizziness, dry mouth, dry skin or itching, flu-like syndrome, increased sweating, leg cramps, loss of appetite, nausea or vomiting, skin rash, unusual tiredness, weight loss, and partial loss of hair.",
            "similarity_score": 91.56
          },
          {
            "drug_id": "Unknown Drug",
            "section": "toxicity",
            "text": "Toxicity: Severe hypoglycemic reactions with coma, seizure, or other neurological impairment.",
            "similarity_score": 91.44
          }
        ],
        "indications": [
          {
            "drug_id": "DB00071",
            "section": "indications",
            "text": "Indications: For the treatment of type I and II diabetes mellitus.",
            "similarity_score": 94.23
          },
          {
            "drug_id": "DB00030",
            "section": "indications",
            "text": "Indications: Human insulin is indicated to improve glycemic control in adults and pediatric patients with diabetes mellitus.",
            "similarity_score": 94.17
          },
          {
            "drug_id": "Unknown Drug",
            "section": "indications",
            "text": "Indications: Insulin aspart is indicated to improve glycemic control in adults and children with diabetes mellitus.[L12273,L42550]",
            "similarity_score": 94.07
          }
        ],
        "names": [
          {
            "drug_id": "DB00030",
            "section": "names",
            "text": "Drug: Insulin human, Synonyms: High molecular weight insulin human, Human insulin, human insulin (rDNA), Insulin (human), Insulin human, ID: DB00030",
            "similarity_score": 93.94
          },
          {
            "drug_id": "DB00071",
            "section": "names",
            "text": "Drug: Insulin pork, Synonyms: Insulin (pork), Insulin porcine, Insulin purified porcine, Insulin purified pork, Insulin, porcine, ID: DB00071",
            "similarity_score": 93.87
          },
          {
            "drug_id": "Unknown Drug",
            "section": "names",
            "text": "Drug: Insulin beef, Synonyms: Insulin (beef), Insulin bovine, Insulin purified beef, ID: Unknown Drug",
            "similarity_score": 93.49
          }
        ]
      }
    }
  ]
}